music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    @album = Album.new(album_params)
    # @album.band_id = params[:band_id]
    if @album
      @album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "w"], ["year", 123], ["band_id", 1], ["created_at", "2018-11-15 23:05:37.453695"], ["updated_at", "2018-11-15 23:05:37.453695"]]

  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 1980], ["updated_at", "2018-11-15 23:39:35.761531"], ["id", 1]]