music_app/app/views/bands/index.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
Albums:
<% band.albums.each do |album| %>